load_stress_tests/artillery-tests/tests/8_http_get.yml
config:
  target: http://localhost:80/chronoweb
  phases:
    - name: Warm-up the API
      duration: 60
      arrivalRate: 5
    - name: Ramp-up to peak load
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: Sustained peak load
      duration: 300
      arrivalRate: 50
  processor: "./processors/processor.js"
scenarios:
  - flow:
      - get:
          url: "/graph/0_9999/outEe"
          qs:
            temporalRelation: "isAfter"
            label: "label"